{"name":"Declaration in Stone","layout":"normal","manaCost":"{1}{W}","cmc":2.0,"type":"Sorcery","rarity":"Rare","text":"Exile target creature and all other creatures its controller controls with the same name as that creature. That player investigates for each nontoken creature exiled this way.","flavor":"The message was clear to Sorin—Nahiri had paid Markov Manor a visit.","artist":"Tyler Jacobson","number":"12s","set":"PSOI","setName":"Shadows over Innistrad Promos","id":"c4cfea5f-e453-5f3b-8038-3307ba335338","supertypes":[],"subtypes":[],"types":["Sorcery"],"colors":["White"],"colorIdentity":["W"],"printings":["PSOI","SOI"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2016-04-08","text":"Declaration in Stone has only one target. The other creatures with that name aren’t targeted. For example, a creature with hexproof will be exiled if it has the same name as the target creature."},{"date":"2016-04-08","text":"If the target creature is an illegal target when Declaration in Stone tries to resolve, it won’t resolve and none of its effects will happen. No creatures will be exiled, including those with the same name as the target."},{"date":"2016-04-08","text":"It’s possible to have a creature and a noncreature permanent with the same name, such as two copies of the same land, one of which has become a land creature. Only creatures with that name are exiled by Declaration in Stone."},{"date":"2016-04-08","text":"A face-down creature, such as one cast with a megamorph ability from the Dragons of Tarkir set, has no name and can’t share a name with any other creatures."},{"date":"2016-04-08","text":"Unless a token is a copy, or unless specified by the effect that created it, a token’s name is the same as its subtypes at the time it was created."},{"date":"2016-04-08","text":"The token is named Clue and has the artifact subtype Clue. Clue isn’t a creature type."},{"date":"2016-04-08","text":"The tokens are normal artifacts. For example, they can be sacrificed to cast Angelic Purge or targeted by Root Out."},{"date":"2016-04-08","text":"If you sacrifice a Clue for another card’s cost or effect, such as that of Angelic Purge or Tamiyo’s Journal, you can’t also pay {2} and sacrifice it to draw a card."}],"foreignNames":[]}
