{"name":"Dreadhorde Invasion","layout":"normal","manaCost":"{1}{B}","cmc":2.0,"type":"Enchantment","rarity":"Rare","text":"At the beginning of your upkeep, you lose 1 life and amass 1. (Put a +1/+1 counter on an Army you control. If you don't control one, create a 0/0 black Zombie Army creature token first.)\nWhenever a Zombie token you control with power 6 or greater attacks, it gains lifelink until end of turn.","artist":"Stanton Feng","number":"86p","set":"PWAR","setName":"War of the Spark Promos","id":"9d8b73cf-bfc7-5873-a65e-f37bd6e99bd1","supertypes":[],"subtypes":[],"types":["Enchantment"],"colors":["Black"],"colorIdentity":["B"],"variations":["36417b88-ff3b-50aa-ac97-51528e719b3a"],"printings":["PWAR","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"The power of the Zombie token is checked only immediately after it attacks. Any other abilities that trigger when creatures you control attack won’t have resolved yet."},{"date":"2019-05-03","text":"If the token’s power changes later in the turn after it has attacked, including while Dreadhorde Invasion’s second ability is on the stack, it won’t cause the token to gain or lose lifelink."},{"date":"2019-05-03","text":"Army is a new creature type. It’s possible to control a nontoken Army (perhaps a creature with the changeling ability) and, through combinations of other cards, it’s possible to control multiple Army tokens. When instructed to amass, you may put +1/+1 counters on any of your Army creatures, and you may choose a different one each time."},{"date":"2019-05-03","text":"If you don’t control an Army, the Zombie Army token that you create enters the battlefield as a 0/0 creature. Any abilities that trigger when a creature with a certain power enters the battlefield, such as that of Mentor of the Meek, will see the token enter as a 0/0 creature before it gets +1/+1 counters."},{"date":"2019-05-03","text":"Some cards that cause you to amass also provide bonuses to “Zombie tokens.” These affect any token that happens to be a Zombie, not just a Zombie Army you’ve amassed."}],"foreignNames":[]}
