{"name":"Dreadhorde Arcanist","layout":"normal","manaCost":"{1}{R}","cmc":2.0,"type":"Creature — Zombie Wizard","rarity":"Rare","text":"Trample\nWhenever Dreadhorde Arcanist attacks, you may cast target instant or sorcery card with converted mana cost less than or equal to Dreadhorde Arcanist's power from your graveyard without paying its mana cost. If that spell would be put into your graveyard this turn, exile it instead.","artist":"G-host Lee","number":"125p","power":"1","toughness":"3","set":"PWAR","setName":"War of the Spark Promos","id":"a0c7856f-994e-5508-93fd-464c0849d960","supertypes":[],"subtypes":["Zombie","Wizard"],"types":["Creature"],"colors":["Red"],"colorIdentity":["R"],"variations":["efdda9e0-b8b7-5527-b5d7-3e249177416e"],"printings":["PWAR","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"The instant or sorcery card you target must have converted mana cost less than or equal to Dreadhorde Arcanist’s power immediately after Dreadhorde Arcanist has attacked. Any other abilities that trigger when creatures you control attack won’t have resolved yet."},{"date":"2019-05-03","text":"If Dreadhorde Arcanist leaves the battlefield before its triggered ability resolves, use its power as it last existed on the battlefield to check whether the card is still a legal target."},{"date":"2019-05-03","text":"If you cast the card, you do so as part of the resolution of Dreadhorde Arcanist’s triggered ability. You can’t wait to cast it later in the turn. Timing permissions based on a card’s type are ignored, and the spell resolve before blockers are declared."},{"date":"2019-05-03","text":"If you cast a card “without paying its mana cost,” you can’t choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Spark Harvest, you must pay those to cast the card."},{"date":"2019-05-03","text":"If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."}],"foreignNames":[]}
