{"name":"Finale of Eternity","layout":"normal","manaCost":"{X}{B}{B}","cmc":2.0,"type":"Sorcery","rarity":"Mythic","text":"Destroy up to three target creatures with toughness X or less. If X is 10 or more, return all creature cards from your graveyard to the battlefield.","flavor":"When you rule by fear, your greatest weakness is one who's no longer afraid.","artist":"Daarken","number":"91p","set":"PWAR","setName":"War of the Spark Promos","id":"2723bd57-76f6-5dc6-9ca7-f6fe6ee22e9e","supertypes":[],"subtypes":[],"types":["Sorcery"],"colors":["Black"],"colorIdentity":["B"],"variations":["0a88c966-8930-5e3c-9374-dc5255e3e0be"],"printings":["PWAR","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"Finale of Eternity can target up to three creatures that each have toughness X or less. That is, their total toughness doesn’t have to be X or less."},{"date":"2019-05-03","text":"If some but not all of the target creatures you choose are illegal targets as Finale of Eternity resolves, the legal targets are still destroyed and, if X is 10 or more, you still return cards to the battlefield."},{"date":"2019-05-03","text":"If some or all of the targets are legal targets but aren’t destroyed, most likely because they have indestructible, you’ll still return cards to the battlefield if X is 10 or more."},{"date":"2019-05-03","text":"If you target a creature you own and X is 10 or more, that card will be among those returned to the battlefield."},{"date":"2019-05-03","text":"Any abilities that trigger on the target creatures dying or on the creatures returning to the battlefield will all be put onto the stack after Finale of Eternity has finished resolving. If it’s your turn, your opponent’s triggers resolve first, even though their creatures died before your creatures entered the battlefield."},{"date":"2019-05-03","text":"You may cast Finale of Eternity without choosing any target creatures. If X is 10 or more, you’ll just return all creature cards from your graveyard to the battlefield. However, if you choose any targets and all of those targets become illegal before the spell tries to resolve, the spell won’t resolve and you won’t put any cards onto the battlefield."}],"foreignNames":[]}
