{"name":"God-Eternal Bontu","layout":"normal","manaCost":"{3}{B}{B}","cmc":5.0,"type":"Legendary Creature — Zombie God","rarity":"Mythic","text":"Menace\nWhen God-Eternal Bontu enters the battlefield, sacrifice any number of other permanents, then draw that many cards.\nWhen God-Eternal Bontu dies or is put into exile from the battlefield, you may put it into its owner's library third from the top.","artist":"Adam Paquette","number":"92","power":"5","toughness":"6","set":"PS19","setName":"San Diego Comic-Con 2019","id":"6bea4a64-ed68-5f3b-a3a1-bbc21e979510","supertypes":["Legendary"],"subtypes":["Zombie","God"],"types":["Creature"],"colors":["Black"],"colorIdentity":["B"],"printings":["PS19","PWAR","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"As Bontu’s first triggered ability resolves, you may choose to sacrifice zero other permanents."},{"date":"2019-05-03","text":"If any abilities trigger as you sacrifice other permanents, those abilities won’t be put onto the stack until after you’ve drawn cards."},{"date":"2019-05-03","text":"If a second God-Eternal Bontu enters the battlefield under your control, you’ll put one into your graveyard before you can sacrifice anything to the new Bontu’s triggered ability."},{"date":"2019-05-03","text":"If one of these Gods leaves the graveyard or exile while its last ability is on the stack, it will remain in its new zone, even if that zone is a graveyard or exile."},{"date":"2019-05-03","text":"If the God’s owner has two or fewer cards in their library, the God is put on the bottom of their library as its last ability resolves."},{"date":"2019-05-03","text":"If you control another player’s God when it dies, you decide whether to put that card into its owner’s library."},{"date":"2019-05-03","text":"If an effect exiles the God and immediately returns it to the battlefield, its last ability triggers but will have no effect. However, if an effect exiles it and would return it to the battlefield at a later time, the God’s ability may return that card its owner’s library first. If it does, the effect that exiled it won’t return it later."},{"date":"2019-05-03","text":"In a multiplayer game, if you put another player’s God onto the battlefield under your control, it will be exiled as you leave the game. If you were still the controller of that God, you would control its triggered ability but you have left the game; that ability won’t resolve and the card remains in exile. Similarly, if you lose the game at the same time that another player’s God that you put onto the battlefield is destroyed, it remains in its owner’s graveyard."},{"date":"2019-05-03","text":"If one of these Gods would die and it’s your commander in the Commander variant, you may put it into the command zone instead. If you save your commander this way, it doesn’t die and you won’t put it into your library. The same is true if it would be exiled."}],"foreignNames":[]}
