{"name":"Harm's Way","layout":"normal","manaCost":"{W}","cmc":1.0,"type":"Instant","rarity":"Uncommon","text":"The next 2 damage that a source of your choice would deal to you and/or permanents you control this turn is dealt to any target instead.","flavor":"Even when fate is already written, there's always time to change the names.","artist":"Dan Scott","number":"23","multiverseid":243440,"originalText":"The next 2 damage that a source of your choice would deal to you and/or permanents you control this turn is dealt to target creature or player instead.","originalType":"Instant","set":"DDG","setName":"Duel Decks: Knights vs. Dragons","id":"68c3ce82-5962-56b9-b33e-fd191352dffb","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=243440&type=card","supertypes":[],"subtypes":[],"types":["Instant"],"colors":["White"],"colorIdentity":["W"],"printings":["DDG","M10"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2009-10-01","text":"As you cast Harm’s Way, you target that the redirected damage will be dealt to. As Harm’s Way resolves, you choose a source of damage. You never choose the original recipient of the damage; Harm’s Way will apply to whatever the chosen source tries to deal damage to, as long as it’s you or a permanent you control."},{"date":"2009-10-01","text":"If the chosen source would deal just 1 damage to you or a permanent you control, Harm’s Way’s effect will redirect that damage and still have a “shield” left for another 1 damage from that source later in the turn."},{"date":"2009-10-01","text":"If the chosen source would simultaneously deal damage to multiple permanents you control (like Pyroclasm could) or to you and at least one permanent you control (like Earthquake could), Harm’s Way will redirect just 2 of that damage. It won’t redirect the next 2 damage that would be dealt to each recipient. You choose which 2 damage is redirected. If you like, you can choose to redirect 1 damage that would be dealt by the chosen source to each of two different recipients."},{"date":"2009-10-01","text":"After Harm’s Way resolves, it no longer checks to see if the target is a legal target. However, if that permanent or player can’t be dealt damage at the time the chosen source would deal damage (perhaps because the creature is no longer on the battlefield or is no longer a creature, or because the player is no longer in the game), the damage can’t be redirected. It’s dealt to the original recipient."},{"date":"2009-10-01","text":"Harm’s Way has no effect on damage that’s already been dealt."}],"foreignNames":[{"name":"Schicksalspfad","language":"German","multiverseid":243767,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=243767&type=card"},{"name":"En peligro","language":"Spanish","multiverseid":244095,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=244095&type=card"},{"name":"Mise en danger","language":"French","multiverseid":243849,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=243849&type=card"},{"name":"In Pericolo","language":"Italian","multiverseid":243931,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=243931&type=card"}]}
