{"name":"Jace, Vryn's Prodigy","layout":"transform","manaCost":"{1}{U}","cmc":2.0,"type":"Legendary Creature — Human Wizard","rarity":"Mythic","text":"{T}: Draw a card, then discard a card. If there are five or more cards in your graveyard, exile Jace, Vryn's Prodigy, then return him to the battlefield transformed under his owner's control.","flavor":"\"People's thoughts just come to me. Sometimes I don't know if it's them or me thinking.\"","artist":"Jaime Jones","number":"60","power":"0","toughness":"2","multiverseid":398434,"originalText":"{T}: Draw a card, then discard a card. If there are five or more cards in your graveyard, exile Jace, Vryn's Prodigy, then return him to the battlefield transformed under his owner's control.","originalType":"Legendary Creature — Human Wizard","set":"ORI","setName":"Magic Origins","id":"08219bab-3ec1-5634-ab8c-4266570c1bda","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=398434&type=card","names":["Jace, Vryn's Prodigy","Jace, Telepath Unbound"],"supertypes":["Legendary"],"subtypes":["Human","Wizard"],"types":["Creature"],"colors":["Blue"],"colorIdentity":["U"],"printings":["ORI","PORI","PS15","V17"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2015-06-22","text":"A double-faced card enters the battlefield with its front face up by default, unless a spell or ability instructs you to put it onto the battlefield transformed, in which case it enters with its back face up."},{"date":"2015-06-22","text":"A Magic Origins planeswalker that enters the battlefield because of the ability of its front face will enter with loyalty counters as normal."},{"date":"2015-06-22","text":"In some rare cases, a spell or ability may cause one of these five cards to transform while it’s a creature (front face up) on the battlefield. If this happens, the resulting planeswalker won’t have any loyalty counters on it and will subsequently be put into its owner’s graveyard."},{"date":"2015-06-22","text":"You can activate one of the planeswalker’s loyalty abilities the turn it enters the battlefield. However, you may do so only during one of your main phases when the stack is empty. For example, if the planeswalker enters the battlefield during combat, there will be an opportunity for your opponent to remove it before you can activate one of its abilities."},{"date":"2015-06-22","text":"If a double-faced card is manifested, it will be put onto the battlefield face down (this is also true if it’s put onto the battlefield face down some other way). Note that “face down” is not synonymous with “with its back face up.” A manifested double-faced card is a 2/2 creature with no name, mana cost, creature types, or abilities. While face down, it can’t transform. If the front face of a manifested double-faced card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up. A double-faced card on the battlefield can’t be turned face down."},{"date":"2015-06-22","text":"If you activate the second ability of Jace, Telepath Unbound, you must follow the timing rules for the card’s types. For example, if you target a sorcery card, you may cast it during your main phase when the stack is empty. You pay all the spell’s costs."},{"date":"2015-06-22","text":"If you don’t cast the card that turn, nothing happens. It remains in your graveyard."},{"date":"2015-06-22","text":"The card is exiled only if it’s cast from the graveyard and put back into the graveyard (either by resolving or being countered). If, at any time, the card goes to a hidden zone (such as your hand or your library), the effect loses track of the card. It won’t be exiled, even if that card is put into your graveyard later that turn."},{"date":"2015-06-22","text":"The activated ability of Jace, Vryn’s Prodigy checks to see if there are five or more cards in your graveyard after you discard a card. Putting a fifth card into your graveyard at other times won’t cause Jace to be exiled, nor will Jace entering the battlefield while there are five or more cards in your graveyard."},{"date":"2015-06-22","text":"Each face of a double-faced card has its own set of characteristics: name, types, subtypes, power and toughness, loyalty, abilities, and so on. While a double-faced card is on the battlefield, consider only the characteristics of the face that’s currently up. The other set of characteristics is ignored. While a double-faced card isn’t on the battlefield, consider only the characteristics of its front face."},{"date":"2015-06-22","text":"The converted mana cost of a double-faced card not on the battlefield is the converted mana cost of its front face."},{"date":"2015-06-22","text":"The back face of a double-faced card (in the case of Magic Origins, the planeswalker face) can’t be cast."},{"date":"2016-04-08","text":"If you discard a card with madness while resolving the ability of Jace, Vryn’s Prodigy, you’ll need to already have five other cards in your graveyard to satisfy that ability’s condition. You can’t choose to put the card directly into your graveyard to satisfy it."},{"date":"2016-04-08","text":"The back face of a double-faced card doesn’t have a mana cost. A double-faced permanent with its back face up has a converted mana cost equal to the converted mana cost of its front face. Each back face has a color indicator that defines its color."},{"date":"2016-07-13","text":"For more information on double-faced cards, see the Shadows over Innistrad mechanics article (http://magic.wizards.com/en/articles/archive/feature/shadows-over-innistrad-mechanics)."},{"date":"2017-07-17","text":"Jace, Vryn's Prodigy is banned as a commander in Duel Commander format, but it may be part of your deck."},{"date":"2017-09-29","text":"You can control two of this permanent, one front-face up and the other back-face up, at the same time."}],"foreignNames":[{"name":"Jace, Wunderkind von Vryn","language":"German","multiverseid":399265,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=399265&type=card"},{"name":"Jace, prodigio de Vryn","language":"Spanish","multiverseid":401204,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=401204&type=card"},{"name":"Jace, prodige de Vryn","language":"French","multiverseid":399542,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=399542&type=card"},{"name":"Jace, Prodigio di Vryn","language":"Italian","multiverseid":399819,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=399819&type=card"},{"name":"ヴリンの神童、ジェイス","language":"Japanese","multiverseid":400096,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=400096&type=card"},{"name":"브린의 신동 제이스","language":"Korean","multiverseid":400373,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=400373&type=card"},{"name":"Jace, Prodígio de Vryn","language":"Portuguese (Brazil)","multiverseid":400650,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=400650&type=card"},{"name":"Джейс, Гений из Врина","language":"Russian","multiverseid":400927,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=400927&type=card"},{"name":"维林逸才杰斯","language":"Chinese Simplified","multiverseid":398711,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=398711&type=card"},{"name":"維林逸才傑斯","language":"Chinese Traditional","multiverseid":398988,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=398988&type=card"}]}
