{"name":"Liliana, Dreadhorde General","layout":"normal","manaCost":"{4}{B}{B}","cmc":6.0,"type":"Legendary Planeswalker — Liliana","rarity":"Mythic","text":"Whenever a creature you control dies, draw a card.\n[+1]: Create a 2/2 black Zombie creature token.\n[−4]: Each player sacrifices two creatures.\n[−9]: Each opponent chooses a permanent they control of each permanent type and sacrifices the rest.","artist":"Chris Rallis","number":"p2020-3","loyalty":"6","set":"PPRO","setName":"Pro Tour Promos","id":"d5d0d464-d01d-55ea-a250-6d81bebfd184","supertypes":["Legendary"],"subtypes":["Liliana"],"types":["Planeswalker"],"colors":["Black"],"colorIdentity":["B"],"printings":["PPRO","PRM","PWAR","SLD","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"If Liliana dies at the same time as one or more creatures you control, her first ability triggers for each of those creatures."},{"date":"2019-05-03","text":"If Liliana somehow becomes a creature and dies, her first ability will trigger."},{"date":"2019-05-03","text":"As Liliana’s second loyalty ability resolves, first the player whose turn it is chooses two creatures they control, then each other player in turn order does the same, knowing the choices made before them. Then all the chosen creatures are sacrificed at the same time. If any player can choose only one creature, that player does so."},{"date":"2019-05-03","text":"As Liliana’s last ability resolves, the next opponent in turn order (or, if it’s somehow an opponent’s turn, that opponent) makes all of their choices for it, then each other opponent in turn order does the same, knowing the choices made before them. Then all the unchosen permanents are sacrificed at the same time."},{"date":"2019-05-03","text":"The permanent types are artifact, creature, enchantment, land, and planeswalker. Supertypes, like legendary, aren’t permanent types."},{"date":"2019-05-03","text":"While making choices for Liliana’s last ability, if a permanent has more than one permanent type, it can count for any of them. For example, you could choose an artifact creature as the artifact you’re sparing, another creature as the creature, and an enchantment creature as the enchantment. Similarly, you could choose an enchantment creature as both the creature and the enchantment that you’re sparing, even if you control another creature and/or another enchantment."}],"foreignNames":[{"name":"戦慄衆の将軍、リリアナ","language":"Japanese"}]}
