{"name":"Mammoth Umbra","layout":"normal","manaCost":"{4}{W}","cmc":5.0,"type":"Enchantment — Aura","rarity":"Uncommon","text":"Enchant creature\nEnchanted creature gets +3/+3 and has vigilance.\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)","artist":"Howard Lyon","number":"10","multiverseid":271152,"originalText":"Enchant creature\nEnchanted creature gets +3/+3 and has vigilance.\nTotem armor (If enchanted creature would be destroyed, instead remove all damage from it and destroy this Aura.)","originalType":"Enchantment — Aura","set":"PC2","setName":"Planechase 2012","id":"b550e57f-19a4-5616-8d6d-5ea94984782c","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=271152&type=card","supertypes":[],"subtypes":["Aura"],"types":["Enchantment"],"colors":["White"],"colorIdentity":["W"],"printings":["PC2","PCA","ROE","UMA"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pauper","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2010-06-15","text":"If a creature enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time the totem armor’s effect will replace all of them and save the creature."},{"date":"2010-06-15","text":"If a spell or ability (such as Planar Cleansing) would destroy both an Aura with totem armor and the permanent it’s enchanting at the same time, totem armor’s effect will save the enchanted permanent from being destroyed. Instead, the spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."},{"date":"2010-06-15","text":"Totem armor’s effect is mandatory. If the enchanted permanent would be destroyed, you must remove all damage from it and destroy the Aura that has totem armor instead."},{"date":"2010-06-15","text":"Say you control a permanent enchanted with an Aura that has totem armor, and the enchanted permanent has gained a regeneration shield. The next time it would be destroyed, you choose whether to apply the regeneration effect or the totem armor effect. The other effect is unused and remains, in case the permanent would be destroyed again."},{"date":"2010-06-15","text":"If a spell or ability says that it would “destroy” a permanent enchanted with an Aura that has totem armor, that spell or ability causes the Aura to be destroyed instead. (This matters for cards such as Karmic Justice.) Totem armor doesn’t destroy the Aura; rather, it changes the effects of the spell or ability. On the other hand, if a spell or ability deals lethal damage to a creature enchanted with an Aura that has totem armor, the game rules regarding lethal damage cause the Aura to be destroyed, not that spell or ability."},{"date":"2010-06-15","text":"Totem armor’s effect is not regeneration. Specifically, if totem armor’s effect is applied, the enchanted permanent does not become tapped and is not removed from combat as a result. Effects that say the enchanted permanent can’t be regenerated (as Vendetta does) won’t prevent totem armor’s effect from being applied."},{"date":"2010-06-15","text":"Totem armor’s effect is applied no matter why the enchanted permanent would be destroyed: because it’s been dealt lethal damage, or because it’s being affected by an effect that says to “destroy” it (such as Doom Blade). In either case, all damage is removed from the permanent and the Aura is destroyed instead."},{"date":"2010-06-15","text":"If a permanent you control is enchanted with multiple Auras that have totem armor, and the enchanted permanent would be destroyed, one of those Auras is destroyed instead — but only one of them. You choose which one because you control the enchanted permanent."},{"date":"2013-07-01","text":"Totem armor has no effect if the enchanted permanent is put into a graveyard for any other reason, such as if it’s sacrificed, if it’s legendary and another legendary permanent with the same name is controlled by the same player, or if its toughness is 0 or less."},{"date":"2013-07-01","text":"If a creature enchanted with an Aura that has totem armor has indestructible, lethal damage and effects that try to destroy it simply have no effect. Totem armor won’t do anything because it won’t have to."},{"date":"2013-07-01","text":"Say you control a permanent enchanted with an Aura that has totem armor, and that Aura has gained a regeneration shield. The next time the enchanted permanent would be destroyed, the Aura would be destroyed instead — but it regenerates, so nothing is destroyed at all. Alternately, if that Aura somehow gains indestructible, the enchanted permanent is effectively indestructible as well."}],"foreignNames":[{"name":"Schattenhaftes Mammut","language":"German","multiverseid":287888,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=287888&type=card"},{"name":"Umbra de mamut","language":"Spanish","multiverseid":288044,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=288044&type=card"},{"name":"Ombre de mammouth","language":"French","multiverseid":287732,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=287732&type=card"},{"name":"Essenza del Mammut","language":"Italian","multiverseid":288200,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=288200&type=card"},{"name":"マンモスの陰影","language":"Japanese","multiverseid":288356,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=288356&type=card"}]}
