{"name":"Massacre Girl","layout":"normal","manaCost":"{3}{B}{B}","cmc":5.0,"type":"Legendary Creature — Human Assassin","rarity":"Rare","text":"Menace\nWhen Massacre Girl enters the battlefield, each other creature gets -1/-1 until end of turn. Whenever a creature dies this turn, each creature other than Massacre Girl gets -1/-1 until end of turn.","artist":"Chris Rallis","number":"99s","power":"4","toughness":"4","set":"PWAR","setName":"War of the Spark Promos","id":"4489adf2-21fd-56fc-823a-3d83c83fbee0","supertypes":["Legendary"],"subtypes":["Human","Assassin"],"types":["Creature"],"colors":["Black"],"colorIdentity":["B"],"printings":["PWAR","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-05-03","text":"Massacre Girl’s enters-the-battlefield triggered ability and its delayed triggered ability each affect only creatures on the battlefield at the time that those abilities resolve. Creatures that enter the battlefield or become creatures later in the turn won’t get -1/-1 unless the delayed triggered ability triggers and resolves again later."},{"date":"2019-05-03","text":"Once Massacre Girl’s enters-the-battlefield ability has triggered, it doesn’t matter whether Massacre Girl remains on the battlefield. The delayed triggered ability will be created as the enters-the-battlefield ability resolves."},{"date":"2019-05-03","text":"Creatures that die while Massacre Girl’s triggered ability is still on the stack won’t cause its delayed triggered ability to trigger since that delayed triggered ability hasn’t been created yet."},{"date":"2019-05-03","text":"A creature with 0 toughness doesn’t die immediately. Rather, the creature dies the next time a player would receive priority. This means that any creatures whose toughness becomes 0 as Massacre Girl’s enters-the-battlefield ability resolves will remain on the battlefield until just after the delayed triggered ability has been created."},{"date":"2019-05-03","text":"If more than one creature dies at once, Massacre Girl’s delayed triggered ability triggers that many times."}],"foreignNames":[]}
