{"name":"Narset, Parter of Veils","layout":"normal","manaCost":"{1}{U}{U}","cmc":3.0,"type":"Legendary Planeswalker — Narset","rarity":"Uncommon","text":"Each opponent can't draw more than one card each turn.\n[−2]: Look at the top four cards of your library. You may reveal a noncreature, nonland card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.","artist":"Magali Villeneuve","number":"p2020-1","loyalty":"5","set":"PPRO","setName":"Pro Tour Promos","id":"4ea275a3-2749-526e-8605-393ad646e5e8","supertypes":["Legendary"],"subtypes":["Narset"],"types":["Planeswalker"],"colors":["Blue"],"colorIdentity":["U"],"printings":["PPRO","PRM","PWAR","SLD","WAR"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Restricted"}],"rulings":[{"date":"2019-05-03","text":"Your opponents can each draw a maximum of one card each on each player’s turn. Subsequent card draws during that turn are ignored."},{"date":"2019-05-03","text":"If an opponent hasn’t drawn any cards in a turn and a spell or ability instructs that player to draw multiple cards, that player will just draw one card. However, if the draws are optional, the player can’t choose to draw, even if they could draw one card this way."},{"date":"2019-05-03","text":"Narset will “see” cards drawn by opponents earlier in the turn she entered the battlefield, although Narset can’t affect cards drawn before she entered the battlefield. For example, if an opponent draws two cards, then Narset enters the battlefield, that opponent can’t draw more cards that turn, but the two drawn cards are unaffected."},{"date":"2019-05-03","text":"Replacement effects (such as that of Underrealm Lich or the first ability of Jace, Wielder of Mysteries) can’t be used to replace draws that Narset disallows. However, if an opponent’s first draw is replaced (by Underrealm Lich’s ability, for example), that draw didn’t happen and Narset won’t stop the next draw (which may also be replaced by Underrealm Lich’s ability)."}],"foreignNames":[{"name":"覆いを割く者、ナーセット","language":"Japanese"}]}
