{"name":"Nimble Obstructionist","layout":"normal","manaCost":"{2}{U}","cmc":3.0,"type":"Creature — Bird Wizard","rarity":"Rare","text":"Flash\nFlying\nCycling {2}{U} ({2}{U}, Discard this card: Draw a card.)\nWhen you cycle Nimble Obstructionist, counter target activated or triggered ability you don't control.","artist":"Shreya Shetty","number":"71","power":"3","toughness":"1","set":"AKR","setName":"Amonkhet Remastered","id":"7a120d20-1045-57a5-a4b3-9c0606a363b8","supertypes":[],"subtypes":["Bird","Wizard"],"types":["Creature"],"colors":["Blue"],"colorIdentity":["U"],"printings":["AKR","C20","HOU","PHOU"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2017-04-18","text":"Triggered abilities from cycling a card and the cycling ability itself aren’t spells. Effects that interact with spells (such as that of Cancel) won’t affect them."},{"date":"2017-04-18","text":"You can cycle a card even if it has a triggered ability from cycling that won’t have a legal target. This is because the cycling ability and the triggered ability are separate. This also means that if either ability doesn’t resolve (due to being countered with Disallow, for example, or if the triggered ability’s targets have become illegal), the other ability will still resolve."},{"date":"2017-04-18","text":"Some cards with cycling have an ability that triggers when you cycle them. These triggered abilities resolve before you draw from the cycling ability."},{"date":"2017-07-14","text":"Abilities that create replacement effects, such as a permanent entering the battlefield tapped or with counters on it, can’t be targeted. Abilities that apply “as [this creature] enters the battlefield” are also replacement effects and can’t be targeted."},{"date":"2017-07-14","text":"Triggered abilities use the word “when,” “whenever,” or “at.” They’re often written as “[Trigger condition], [effect].” Some keyword abilities, such as prowess and afflict, are triggered abilities and will have “when,” “whenever,” or “at” in their reminder text."},{"date":"2017-07-14","text":"If you counter a delayed triggered ability that triggers at the beginning of the “next” occurrence of a specified step or phase, that ability won’t trigger again the following time that phase or step occurs."},{"date":"2017-07-14","text":"Mana abilities can’t be targeted. An activated mana ability is one that adds mana to a player’s mana pool as it resolves, doesn’t have a target, and isn’t a loyalty ability. A triggered mana ability is one that adds mana to a player’s mana pool and triggers on an activated mana ability."},{"date":"2017-07-14","text":"Activated abilities are written in the form “Cost: Effect.” Some keyword abilities, such as equip and eternalize, are activated abilities and will have colons in their reminder texts."}],"foreignNames":[]}
