{"name":"Purphoros, God of the Forge","layout":"normal","manaCost":"{3}{R}","cmc":4.0,"type":"Legendary Enchantment Creature — God","rarity":"Mythic","text":"Indestructible\nAs long as your devotion to red is less than five, Purphoros isn't a creature.\nWhenever another creature enters the battlefield under your control, Purphoros deals 2 damage to each opponent.\n{2}{R}: Creatures you control get +1/+0 until end of turn.","artist":"Eric Deschamps","number":"1029","power":"6","toughness":"5","set":"MB1","setName":"Mystery Booster","id":"6d56878c-7305-5e35-b6c5-7d359911c9c6","supertypes":["Legendary"],"subtypes":["God"],"types":["Enchantment","Creature"],"colors":["Red"],"colorIdentity":["R"],"printings":["MB1","SLD","THS"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2013-09-15","text":"Numeric mana symbols ({0}, {1}, and so on) in mana costs of permanents you control don’t count toward your devotion to any color."},{"date":"2013-09-15","text":"Mana symbols in the text boxes of permanents you control don’t count toward your devotion to any color."},{"date":"2013-09-15","text":"Hybrid mana symbols, monocolored hybrid mana symbols, and Phyrexian mana symbols do count toward your devotion to their color(s)."},{"date":"2013-09-15","text":"If an activated ability or triggered ability has an effect that depends on your devotion to a color, you count the number of mana symbols of that color among the mana costs of permanents you control as the ability resolves. The permanent with that ability will be counted if it’s still on the battlefield at that time."},{"date":"2013-09-15","text":"The type-changing ability that can make the God not be a creature functions only on the battlefield. It’s always a creature card in other zones, regardless of your devotion to its color."},{"date":"2013-09-15","text":"If a God enters the battlefield, your devotion to its color (including the mana symbols in the mana cost of the God itself) will determine if a creature entered the battlefield or not, for abilities that trigger whenever a creature enters the battlefield."},{"date":"2013-09-15","text":"If a God stops being a creature, it loses the type creature and all creature subtypes. It continues to be a legendary enchantment."},{"date":"2013-09-15","text":"The abilities of Gods function as long as they’re on the battlefield, regardless of whether they’re creatures."},{"date":"2013-09-15","text":"If a God is attacking or blocking and it stops being a creature, it will be removed from combat."},{"date":"2013-09-15","text":"If a God is dealt damage, then stops being a creature, then becomes a creature again later in the same turn, the damage will still be marked on it. This is also true for any effects that were affecting the God when it was originally a creature. (Note that in most cases, the damage marked on the God won’t matter because it has indestructible.)"}],"foreignNames":[]}
