{"name":"Rix Maadi Reveler","layout":"normal","manaCost":"{1}{R}","cmc":2.0,"type":"Creature — Human Shaman","rarity":"Rare","text":"Spectacle {2}{B}{R} (You may cast this spell for its spectacle cost rather than its mana cost if an opponent lost life this turn.)\nWhen Rix Maadi Reveler enters the battlefield, discard a card, then draw a card. If Rix Maadi Reveler's spectacle cost was paid, instead discard your hand, then draw three cards.","artist":"Sara Winters","number":"109s","power":"2","toughness":"2","watermark":"rakdos","set":"PRNA","setName":"Ravnica Allegiance Promos","id":"47b36cab-3fda-5444-970a-acf26d3f6617","supertypes":[],"subtypes":["Human","Shaman"],"types":["Creature"],"colors":["Red"],"colorIdentity":["B","R"],"printings":["PRNA","RNA"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2019-01-25","text":"Rix Maadi Reveler is only red. It’s not black, even if you cast it for its spectacle cost."},{"date":"2019-01-25","text":"If you have no cards in hand, you won’t discard any cards, and then you’ll draw one or three cards as appropriate."},{"date":"2019-01-25","text":"Damage dealt to a player causes that player to lose that much life."},{"date":"2019-01-25","text":"Spectacle doesn’t change when you can cast the card. For example, you can’t cast a sorcery with spectacle during an opponent’s turn unless another effect allows you to do so, even if that player has lost life this turn."},{"date":"2019-01-25","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying (such as a spectacle cost), add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."},{"date":"2019-01-25","text":"A card’s spectacle cost is the same no matter how much life your opponents lost or how many opponents lost life."},{"date":"2019-01-25","text":"In a multiplayer game, if an opponent loses life and later that turn leaves the game, you can cast a spell for its spectacle cost. (If a player leaves the game during their turn, that turn continues without an active player.)"}],"foreignNames":[]}
