{"name":"Skymarcher Aspirant","layout":"normal","manaCost":"{W}","cmc":1.0,"type":"Creature — Vampire Soldier","rarity":"Uncommon","text":"Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nSkymarcher Aspirant has flying as long as you have the city's blessing.","flavor":"\"I was born to glory.\"","artist":"Winona Nelson","number":"233","power":"2","toughness":"1","set":"MB1","setName":"Mystery Booster","id":"e985b331-5009-5846-9bb6-2ea396e5580b","supertypes":[],"subtypes":["Vampire","Soldier"],"types":["Creature"],"colors":["White"],"colorIdentity":["W"],"printings":["MB1","RIX"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2018-01-19","text":"Once you have the city’s blessing, you have it for the rest of the game, even if you lose control of some or all of your permanents. The city’s blessing isn’t a permanent itself and can’t be removed by any effect."},{"date":"2018-01-19","text":"A permanent is any object on the battlefield, including tokens and lands. Spells and emblems aren’t permanents."},{"date":"2018-01-19","text":"If you cast a spell with ascend, you don’t get the city’s blessing until it resolves. Players may respond to that spell by trying to change whether you get the city’s blessing."},{"date":"2018-01-19","text":"If you control ten permanents but don’t control a permanent or resolving spell with ascend, you don’t get the city’s blessing. For example, if you control ten permanents, lose control of one, then cast Golden Demise, you won’t have the city’s blessing and the spell will affect creatures you control."},{"date":"2018-01-19","text":"If your tenth permanent enters the battlefield and then a permanent leaves the battlefield immediately afterwards (most likely due to the “Legend Rule” or due to being a creature with 0 toughness), you get the city’s blessing before it leaves the battlefield."},{"date":"2018-01-19","text":"Ascend on a permanent isn’t a triggered ability and doesn’t use the stack. Players can respond to a spell that will give you your tenth permanent, but they can’t respond to getting the city’s blessing once you control that tenth permanent. This means that if your tenth permanent is a land you play, players can’t respond before you get the city’s blessing."},{"date":"2018-01-19","text":"Some cards get power, toughness, and/or abilities once you have the city’s blessing. If another card has an ability that triggers when creatures with certain characteristics enter the battlefield (such as Mentor of the Meek or Elemental Bond do), use the entering permanent’s characteristics after you have the city’s blessing to determine whether those abilities trigger. This is true even if the entering permanent is your tenth permanent."}],"foreignNames":[]}
