{"name":"The Eldest Reborn","layout":"saga","manaCost":"{4}{B}","cmc":5.0,"type":"Enchantment — Saga","rarity":"Uncommon","text":"(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Each opponent sacrifices a creature or planeswalker.\nII — Each opponent discards a card.\nIII — Put target creature or planeswalker card from a graveyard onto the battlefield under your control.","artist":"Jenn Ravenna Tran","number":"131","multiverseid":470677,"originalText":"(As this Saga enters and after your draw step, add a lore counter. Sacrifice after III.)\nI — Each opponent sacrifices a creature or planeswalker.\nII — Each opponent discards a card.\nIII — Put target creature or planeswalker card from a graveyard onto the battlefield under your control.","originalType":"Enchantment — Saga","set":"C19","setName":"Commander 2019","id":"226d1385-95ba-520f-86d4-20a0518df1b4","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=470677&type=card","supertypes":[],"subtypes":["Saga"],"types":["Enchantment"],"colors":["Black"],"colorIdentity":["B"],"printings":["C19","DOM","MB1"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Historic","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2018-04-27","text":"When the first chapter ability of The Eldest Reborn resolves, the next opponent in turn order (or, if it’s an opponent’s turn, that opponent) chooses a creature or planeswalker they control, then each other opponent in turn order (if any) does the same. All chosen permanents are then sacrificed at the same time. Players will know the choices made by earlier players when making their choices."},{"date":"2018-04-27","text":"When the second chapter ability of The Eldest Reborn resolves, the next opponent in turn order (or, if it’s an opponent’s turn, that opponent) chooses a card in hand without revealing it, then each other opponent in turn order (if any) does the same. All chosen cards are then discarded at the same time."},{"date":"2018-04-27","text":"In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, the permanent you control from The Eldest Reborn’s final chapter ability is exiled."},{"date":"2018-04-27","text":"As a Saga enters the battlefield, its controller puts a lore counter on it. As your precombat main phase begins (immediately after your draw step), you put another lore counter on each Saga you control. Putting a lore counter on a Saga in either of these ways doesn’t use the stack."},{"date":"2018-04-27","text":"Each symbol on the left of a Saga’s text box represents a chapter ability. A chapter ability is a triggered ability that triggers when a lore counter that is put on the Saga causes the number of lore counters on the Saga to become equal to or greater than the ability’s chapter number. Chapter abilities are put onto the stack and may be responded to."},{"date":"2018-04-27","text":"A chapter ability doesn’t trigger if a lore counter is put on a Saga that already had a number of lore counters greater than or equal to that chapter’s number. For example, the third lore counter put on a Saga causes the III chapter ability to trigger, but I and II won’t trigger again."},{"date":"2018-04-27","text":"Once a chapter ability has triggered, the ability on the stack won’t be affected if the Saga gains or loses counters, or if it leaves the battlefield."},{"date":"2018-04-27","text":"If multiple chapter abilities trigger at the same time, their controller puts them on the stack in any order. If any of them require targets, those targets are chosen as you put the abilities on the stack, before any of those abilities resolve."},{"date":"2018-04-27","text":"If counters are removed from a Saga, the appropriate chapter abilities will trigger again when the Saga receives lore counters. Removing lore counters won’t cause a previous chapter ability to trigger."},{"date":"2018-04-27","text":"Once the number of lore counters on a Saga is greater than or equal to the greatest number among its chapter abilities—in the Dominaria set, this is always three—the Saga’s controller sacrifices it as soon as its chapter ability has left the stack, most likely by resolving or being countered. This state-based action doesn’t use the stack."}],"foreignNames":[{"name":"Die Wiedergeburt des Ältesten","language":"German","multiverseid":470979,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=470979&type=card"},{"name":"El gran anciano renacido","language":"Spanish","multiverseid":471281,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=471281&type=card"},{"name":"La Renaissance de l'aîné","language":"French","multiverseid":471583,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=471583&type=card"},{"name":"Rinascita dell'Antico","language":"Italian","multiverseid":471885,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=471885&type=card"},{"name":"最古再誕","language":"Japanese","multiverseid":472187,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=472187&type=card"},{"name":"O Ancião Renascido","language":"Portuguese (Brazil)","multiverseid":472489,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=472489&type=card"},{"name":"Перерождение Древнейшего","language":"Russian","multiverseid":472791,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=472791&type=card"}]}
