{"name":"Whip of Erebos","layout":"normal","manaCost":"{2}{B}{B}","cmc":4.0,"type":"Legendary Enchantment Artifact","rarity":"Rare","text":"Creatures you control have lifelink.\n{2}{B}{B}, {T}: Return target creature card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step. If it would leave the battlefield, exile it instead of putting it anywhere else. Activate this ability only any time you could cast a sorcery.","artist":"Marco Nelor","number":"5","set":"CP2","setName":"Fate Reforged Clash Pack","id":"e2adf238-d5d9-50a8-9a45-4f05403b43de","supertypes":["Legendary"],"subtypes":[],"types":["Enchantment","Artifact"],"colors":["Black"],"colorIdentity":["B"],"printings":["CP2","PRM","THS"],"legalities":[{"format":"Commander","legality":"Legal"},{"format":"Duel","legality":"Legal"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Penny","legality":"Legal"},{"format":"Pioneer","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"rulings":[{"date":"2013-09-15","text":"At the beginning of the next end step, the creature returned to the battlefield with Whip of Erebos is exiled. This is a delayed triggered ability. If the ability is countered, the creature will stay on the battlefield and the delayed trigger won’t trigger again. However, the replacement effect will still exile the creature when it eventually leaves the battlefield."},{"date":"2013-09-15","text":"Whip of Erebos grants haste to the creature that’s returned to the battlefield. However, neither of the “exile” abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."},{"date":"2013-09-15","text":"If a creature returned to the battlefield with Whip of Erebos would leave the battlefield for any reason, it’s exiled instead. However, if that creature is already being exiled, then the replacement effect won’t apply. If the spell or ability that exiles it later returns it to the battlefield (as Chained to the Rocks might, for example), the creature card will return to the battlefield as a new object with no relation to its previous existence. The effects from Whip of Erebos will no longer apply to it."},{"date":"2013-09-15","text":"The exiled creature is never put into the graveyard. Any abilities the creature has that trigger when it dies won’t trigger."}],"foreignNames":[]}
